{
    "code": 0,
    "msg": "",
    "data": {
        "data": [{
                "id": 1,
                "type": "数据1",
                "all": "11",
                "on": "111",
                "anomaly": "6666",
                "off": "111"
               
            },
            {
                "id": 2,
                "type": "数据2",
                "all": "22",
                "on": "222",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据3",
                "all": "22",
                "on": "222",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据4",
                "all": "22",
                "on": "222",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据5",
                "all": "22",
                "on": "222",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据6",
                "all": "22",
                "on": "222",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据7",
                "all": "22",
                "on": "222",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据8",
                "all": "99",
                "on": "999",
                "off": "222",
                "anomaly": "222"
            },
            {
                "id": 2,
                "type": "数据2",
                "all": "99",
                "on": "999",
                "off": "222",
                "anomaly": "222"
            }
        ]
    }
}